han-kaka/UEL020100/nRF5_SDK_12.3.0_d7731ad/examples/ble_peripheral/ble_app_uart/code/app/app_comm_ble.c
/**************************************************************************************************
 * @brief       返回错误代码
 * @param       command：命令
 * @param       errCode：错误代码
 * @return      None
 **************************************************************************************************
 */
static void UserReturnErrCode(uint8_t command, uint8_t errCode)
{
		uint8_t  postion = 0;
		uint8_t  *pSendbuf = char4_all_send + sizeof(ProtocolAppHeadFormat_t);
		
		pSendbuf[postion++] = errCode;
	Put_Return(command, postion);
}


/**************************************************************************************************
 * @brief       返回错误代码带数据
 * @param       command：命令
 * @param       errCode：错误代码
 * @param       pData：数据
 * @param       len：数据长度
 * @return      0-成功；other-失败；
 **************************************************************************************************
 */
static void UserReturnErrCodeAndData(uint8_t command, uint8_t errCode, char *pData, uint8_t len)
{
	uint8_t  postion = 0;
	uint8_t  *pSendbuf = char4_all_send + sizeof(ProtocolAppHeadFormat_t);
	
	pSendbuf[postion++] = errCode;
	memcpy(pSendbuf + postion, pData, len);
	postion += len;
	Put_Return(command, postion++);
}

uint8_t ProcessCommand(uint8_t *pData, uint8_t command, uint16_t dataLen)
{
		uint8_t  i, tmp;
		uint8_t  ret = 0;
		uint8_t  *pSendbuf;
		uint16_t sendLength = 0;
		#if (defined USER_FINGERMODE) && (defined USER_FINGERMODEVENA)
		uint16 temp16;
		#endif
		uint32_t tmp32;
////	static uint8  sTemp;
////	static uint8  sReadUserCnt = 0;
////	static uint8  sFlagAddUser = 0;
		uint8_t  buf[16];
////	static UserInfo_t tempUserInfo;
////	UTCTimeStruct *pTempTimeStruct = (UTCTimeStruct *)(buf + 6);
////	LogInfo_t *pTmpLogInfo = (LogInfo_t *)buf;
////	
		if (sProtocolAppFormat.headData.version != PROTOCOL_APP_VERSION)			// 判断协议头正确性
		{
				#if SEGGER_RTT_DEBUG_AES_DECODE
						SEGGER_RTT_printf(0, "PROTOCOL_APP_ERR_VERSION_1!\r\n");
				#endif
				UserReturnErrCode(command, PROTOCOL_APP_ERR_VERSION);
				return ret;
		}
		if (dataLen == 0)
		{
				#if SEGGER_RTT_DEBUG_AES_DECODE
						SEGGER_RTT_printf(0, "PROTOCOL_APP_ERR_PARAM_2!\r\n");
				#endif
				UserReturnErrCode(command, PROTOCOL_APP_ERR_PARAM);
				return ret;
		}
		if ((gSystemRunParam.flagInit != 0xA5) && (command != CMD_GET_AESKEY))
		{
				#if SEGGER_RTT_DEBUG_AES_DECODE
						SEGGER_RTT_printf(0, "PROTOCOL_APP_ERR_PARAM_3!\r\n");
				#endif
				UserReturnErrCode(command, PROTOCOL_APP_ERR_PARAM);
				return ret;
		}
		#if SEGGER_RTT_DEBUG_AES_DECODE
				SEGGER_RTT_printf(0, "command = %d\r\n",command);
		#endif
		
		switch (command)
		{
			
//				case CMD_GET_HARD_INFO_VERSION:											/* 获取硬件版本信息 */
//						UserReturnErrCodeAndData(command, PROTOCOL_APP_ERR_NONE, HARD_VERSION_INFO, sizeof(HARD_VERSION_INFO));
//						break;
//				
//				case CMD_GET_SOFT_INFO_VERSION:											/* 查询软件版本信息 */
//						UserReturnErrCodeAndData(command, PROTOCOL_APP_ERR_NONE, SOFT_VERSION_INFO, sizeof(SOFT_VERSION_INFO));
//						break;
//				
				case CMD_GET_AESKEY:													/* 初始化 */
				{
				#if SEGGER_RTT_DEBUG_GET_AESKEY
						SEGGER_RTT_printf(0, "cmd get aeskey!\r\n");
				#endif
						
						if (*pData != 0x01)
						{
								UserReturnErrCode(command, PROTOCOL_APP_ERR_PARAM);
								break;
						}
						if(gSystemRunParam.flagInit == 0xA5) 
								break;
						pSendbuf = char4_all_send + sizeof(ProtocolAppHeadFormat_t);
						pSendbuf[sendLength++] = PROTOCOL_APP_ERR_NONE;
						nrf_drv_rng_rand(tempkey, 16); 
//						LL_PseudoRand( tempkey, 16 );
						memcpy(pSendbuf + sendLength, tempkey, 16);
//						osal_memcpy(pSendbuf + sendLength, tempkey, 16);
						sendLength += 16;
						f_tempkey = 1;
						memset(buf, 0, 8);
//						UserSaveAppData(P_EE_ADDR_TIMESTAMP, buf);
				#if SEGGER_RTT_DEBUG_GET_AESKEY
						SEGGER_RTT_printf(0, "sendLength = %d!\r\n", sendLength);
				#endif
						Put_Return(command, sendLength);
						gSystemRunParam.flagInit = 0xA5;
//						SaveSetup();
				}
						break;
				
//				case CMD_ADD_ADMIN:														/* 添加管理员 */
//				case CMD_ADD_USER:														/* 添加用户 */
//				{
////						if (stateProcessCommand == 0)
////						{
////							if ((dataLen != 16) && (dataLen != 24))
////							{UserReturnErrCode(command, PROTOCOL_APP_ERR_PARAM);break;}
////							UserGetAppData(P_EE_ADDR_TIMESTAMP, buf);
////							
////							if (dataLen == 16) 
////							{
////								sFlagAddUser = 1;
////								if (UserMemCmp(pData + 8, buf, 8) <= 0) break;
////								UserSaveAppData(P_EE_ADDR_TIMESTAMP, pData + 8);
////							}
////							else 
////							{
////								sFlagAddUser = 11;
////								if (UserMemCmp(pData + 16, buf, 8) <= 0) break;
////								UserSaveAppData(P_EE_ADDR_TIMESTAMP, pData + 16);
////							}
////							stateProcessCommand = 1;
////							ret = 0xFF;
////						}
////						else if (stateProcessCommand == 1)
////						{
////							ret = UserAddUserInfoToSystem(sFlagAddUser, 0, pData);
////							if (ret == 0)
////							{
////								sReadUserCnt = 0;
////								UserSetCurrentUser(pData);
////								UserReturnErrCodeAndData(command, PROTOCOL_APP_ERR_NONE, pData + 8, 16);
////							}
////							else if (ret == 0xFF)
////							{
////								
////							}
////							else
////							{
////								UserReturnErrCodeAndData(command, PROTOCOL_APP_ERR_GEN, pData + 8, 16);
////							}
////						}
////						else 
////						{
////							UserReturnErrCodeAndData(command, PROTOCOL_APP_ERR_GEN, pData + 8, 16);
////						}
//				}
//						break;
//				
//				case CMD_READ_USER:														/* 读取用户 */
//				{
////						if ((dataLen != 1) || (*pData != 0xA2))
////						{UserReturnErrCode(command, PROTOCOL_APP_ERR_PARAM);break;}			/* 数据长度错误，返回参数错误 */
////						if (UserGetCurrentUser() == 0)
////						{UserReturnErrCode(command, PROTOCOL_APP_ERR_NOT_PERMIT);break;}	/* 未登录，返回权限错误 */
////						while (1)
////						{
////							if (sReadUserCnt < MAX_USER_NUM)
////							{
////								if (UserReadUserInfoUID(sReadUserCnt, buf) == 0)
////								{
////									UserReturnErrCodeAndData(command, PROTOCOL_APP_ERR_NONE, buf, 8);
////									sReadUserCnt++;
////									break;
////								}
////								sReadUserCnt++;
////							}
////							else
////							{
////								UserReturnErrCode(command, PROTOCOL_APP_ERR_FINISHED);
////								break;
////							}
////						}
//				}
//						break;
//				
//				case CMD_DEL_USER:														/* 删除用户 */
//				{
////						if (dataLen != 8)
////						{UserReturnErrCode(command, PROTOCOL_APP_ERR_PARAM);break;}			/* 数据长度错误，返回参数错误 */
////						if (UserGetCurrentUser() == 0)
////						{UserReturnErrCode(command, PROTOCOL_APP_ERR_NOT_PERMIT);break;}	/* 未登录，返回权限错误 */
////						
////						UserDelUserInfoFromSystem(pData);
////						UserReturnErrCode(command, PROTOCOL_APP_ERR_NONE);
//				}	
//					break;
//				
//				case CMD_USER_LOGIN:													/* 用户登录 */
//				{
////						if (dataLen != 16)
////						{UserReturnErrCode(command, PROTOCOL_APP_ERR_PARAM);break;}
////						UserGetAppData(P_EE_ADDR_TIMESTAMP, buf);
////						if (UserMemCmp(pData + 8, buf, 8) <= 0) break;
////						UserSaveAppData(P_EE_ADDR_TIMESTAMP, pData + 8);
////						tmp = UserSearchUserInfoNumber(pData);
////						if (tmp < MAX_USER_NUM)
////						{
////							sReadUserCnt = 0;
////							UserSetCurrentUser(pData);
////							UserReturnErrCode(command, PROTOCOL_APP_ERR_NONE);
////						}
////						else
////						{
////							UserReturnErrCode(command, PROTOCOL_APP_ERR_GEN);
////						}
//				}
//					break;
//				
//				case CMD_SET_KEYBOARD:													/* 设置键盘密码 */
//				{
////						if (stateProcessCommand == 0)
////						{
////							stateProcessCommand = 1;
////							ret = 0xFF;
////							
////							if (dataLen != 8)
////							{UserReturnErrCode(command, PROTOCOL_APP_ERR_PARAM);break;}			/* 数据长度错误，返回参数错误 */
////							if (UserGetCurrentUser() == 0)
////							{UserReturnErrCode(command, PROTOCOL_APP_ERR_NOT_PERMIT);break;}	/* 未登录，返回权限错误 */
////						}
////						else if (stateProcessCommand == 1)
////						{
////							for (sTemp = 0; sTemp < MAX_USER_NUM; sTemp ++)
////							{
////								while (UserGetUserInfo(sTemp, &tempUserInfo) == 0xFF);
////								if ((tempUserInfo.flag & 0xC3) != 0xC2) continue;
////								if (UserMemCmp(tempUserInfo.userId, UserGetCurrentUser(), sizeof(tempUserInfo.userId)) == 0) continue;
////								if (UserMemCmp(tempUserInfo.password, pData, sizeof(tempUserInfo.password)) == 0)
////								{
////									break;
////								}
////							}
////							if (sTemp < MAX_USER_NUM)
////							{
////								stateProcessCommand = 3;
////							}
////							else
////							{
////								stateProcessCommand = 2;
////							}
////							ret = 0xFF;
////						}
////						else if (stateProcessCommand == 2)
////						{
////							ret = UserAddUserInfoToSystem(2, UserGetCurrentUser(), pData);
////							if (ret == 0)
////							{
////								UserReturnErrCode(command, PROTOCOL_APP_ERR_NONE);
////							}
////							else if (ret == 0xFF)
////							{
////								
////							}
////							else
////							{
////								UserReturnErrCode(command, PROTOCOL_APP_ERR_GEN);
////							}
////						}
////						else if (stateProcessCommand == 3)
////						{
////							osal_memset(buf, 0, 8);
////							ret = UserAddUserInfoToSystem(2, tempUserInfo.userId, buf);
////							if (ret == 0)
////							{
////								UserReturnErrCode(command, PROTOCOL_APP_ERR_PASSWORD_SAME);
////							}
////							else if (ret == 0xFF)
////							{
////								
////							}
////							else
////							{
////								UserReturnErrCode(command, PROTOCOL_APP_ERR_GEN);
////							}
////						}
//				}
//						break;
//				
//				case CMD_ADD_PERIPHERAL:												/* 添加外设 */
//				{
////						if (dataLen != 1)
////						{UserReturnErrCode(command, PROTOCOL_APP_ERR_PARAM);break;}			/* 数据长度错误，返回参数错误 */
////						if (UserGetCurrentUser() == 0)
////						{UserReturnErrCode(command, PROTOCOL_APP_ERR_NOT_PERMIT);break;}	/* 未登录，返回权限错误 */
////						tmp = UserSearchUserInfoNumber(UserGetCurrentUser());
////						if (tmp >= MAX_USER_NUM)
////						{UserReturnErrCode(command, PROTOCOL_APP_ERR_NOT_PERMIT);break;}
////						if (*pData == 1)
////						{
////							#if (defined USER_FINGERMODE) && (!(defined USER_FINGERMODEVENA))
////							if (UserFingerModuleAddition(tmp, UserFingerAdditionCallback) == FALSE)
////							{
////								UserReturnErrCode(command, PROTOCOL_APP_ERR_GEN);
////								break;
////							}
////							#else
////							UserReturnErrCode(command, PROTOCOL_APP_ERR_PARAM);
////							UserSoundFailuer();
////							break;
////							#endif
////						}
////						else if (*pData == 2)
////						{
////							#ifdef USER_ICCARD
////							if (UserICCardAddition(UserGetCurrentUser()) == FALSE)
////							{
////								UserReturnErrCode(command, PROTOCOL_APP_ERR_GEN);
////								break;
////							}
////							#else
////							UserReturnErrCode(command, PROTOCOL_APP_ERR_PARAM);
////							UserSoundFailuer();
////							break;
////							#endif
////							
////						}
////						else if (*pData == 4)
////						{
////							#if (defined USER_FINGERMODE) && (defined USER_FINGERMODEVENA)
////							if (UserFingerModuleAddition(tmp, UserFingerAdditionCallback) == FALSE)
////							{
////								UserReturnErrCode(command, PROTOCOL_APP_ERR_GEN);
////								break;
////							}
////							#else
////							UserReturnErrCode(command, PROTOCOL_APP_ERR_PARAM);
////							UserSoundFailuer();
////							break;
////							#endif
////						}
////						else
////						{
////							UserReturnErrCode(command, PROTOCOL_APP_ERR_PARAM);
////							UserSoundFailuer();
////							break;
////						}
////						UserReturnErrCode(command, PROTOCOL_APP_ERR_NONE);
//				}
//						break;
//					
				case CMD_SWITCH:														/* 开关指令 */
				{
						#if SEGGER_RTT_DEBUG_SWITCH
								SEGGER_RTT_printf(0, "cmd switch!\r\n");
						#endif
					
						if (dataLen != 9)
						{
								UserReturnErrCode(command, PROTOCOL_APP_ERR_PARAM);
								break;
						}
//						UserGetAppData(P_EE_ADDR_TIMESTAMP, buf);
//						if (UserMemCmp(pData, buf, 8) <= 0) break;
//						UserSaveAppData(P_EE_ADDR_TIMESTAMP, pData);
						
						pSendbuf = char4_all_send + sizeof(ProtocolAppHeadFormat_t);
						pSendbuf[sendLength ++] = PROTOCOL_APP_ERR_NONE;
						pSendbuf[sendLength ++] = gSystemRunParam.batterPercent;
						tmp = 0;
//						if (gFlagAdjustTime <= 1) 
//						{
//								tmp |= BV(0);
//						}
//						if (UserGetLogInfo(0) == 1) 
//						{
//								tmp |= BV(1);
//						}
						pSendbuf[sendLength ++] = tmp;
						Put_Return(command, sendLength);
						if (pData[8] == 0xA1)
						{
								Motor_Status = FOREWARD;
//								Foreward_Motor();
//							UserMotorON(motorOpenTyp_mobile);
						}
						else if (pData[8] == 0xA2)
						{
								Motor_Status = INVERSION;
//								Inversion_Motor();
//							UserMotorOFF();
						}
				}
						break;
				
				case CMD_ADJUST_TIME:													/* 校时指令 */
				{
						#if SEGGER_RTT_DEBUG_ADJUST_TIME
								SEGGER_RTT_printf(0, "cmd adjust time!\r\n");
						#endif
					
						#if PROTOCOL_APP_VERSION == 0x0100
			/****************************** V1.0 版本程序开始 *****************************/
						if (dataLen != 4)
						{UserReturnErrCode(command, PROTOCOL_APP_ERR_PARAM);break;}			/* 数据长度错误，返回参数错误 */
						//if (UserGetCurrentUser() == 0)
						//{UserReturnErrCode(command, PROTOCOL_APP_ERR_NOT_PERMIT);break;}	/* 未登录，返回权限错误 */
						tmp32 = pData[0];
						tmp32 = (tmp32 << 8) | pData[1];
						tmp32 = (tmp32 << 8) | pData[2];
						tmp32 = (tmp32 << 8) | pData[3];
			/****************************** V1.0 版本程序结束 *****************************/
						#else
			/****************************** V1.1 版本程序开始 *****************************/
						if (dataLen != 12)
						{
								UserReturnErrCode(command, PROTOCOL_APP_ERR_PARAM);
								break;
						}			/* 数据长度错误，返回参数错误 */
						
						UserGetAppData(P_EE_ADDR_TIMESTAMP, buf);
						if (UserMemCmp(pData, buf, 8) <= 0) 
								break;
						UserSaveAppData(P_EE_ADDR_TIMESTAMP, pData);
						
